#include <fcntl.h>
#include <stdio.h>
#include <unistd.h>
#include <stdlib.h>
#include <string.h>

/*	
    Задача Да се напише програма на Си, която реализира състезание между два процеса  (вариант с общ ресурс – файл).
    Програмата :
    1.	създава/отваря_съществуващ файл;
    2.	инициализира/записва в началото му начална числова стойност  (примерно  0);
    3.	стартира нов процес  (примитив fork);
    4.	двата процеса (детски и родителски) многократно (цикъл с достатъчен брой итерации) изпълняват една и съща последователност от действия :
        - позициониране на едно и също място във файла (началото)
        - прочитане на целочислена стойност
        - модифициране на стойността (добавяне константна стойност – 1 или 2)
        - извеждане на модифицираната стойност на стандартния изход 
    (целта е предизвикване на входно/изходно прекъсване и удължаване времето за работа на съответния процес) 
    Оформяне на изходите с различен отстъп спрямо началото на реда в различните процеси дава добра възможност за следене  на
     смяната им по време на изпълнение  като резултат от диспечеризацията 
    - позициониране на същото място (началото)
    - запис на модифицираната стойност на мястото на прочетената.
    Очакван резултат – при продължителна работа на процесите, в резултат от диспечеризацията на процесите и 
    преразпределение на отделеното процесорно време, се реализират прекъсвания между операциите на четене и модифициране
    от една страна и записа на изменената стойност на мястото на прочетената от друга, при което се губи, макар и малка, 
    част от натрупваните от процесите стойности - крайният резултат не се явява точната сума на всички добавени (сумирани) стойности .

 */

int main(int argc, char* argv[])
{
    int fd = open("test.txt", O_CREAT | O_RDWR | O_TRUNC, 0666);
    int fd1 = open("test.txt", O_CREAT | O_RDWR | O_TRUNC, 0666);
    char buffer[100];
    if(fd == -1){
        printf("error\n");
        exit(1);
    }
    write(fd, "0", 2);

    int pid = fork();

    for (int i = 0; i < 1000; i++)
    {
         if(pid == 0){
            lseek(fd, 0, SEEK_SET);
            //четем броя прочетени байта
            read(fd, buffer, 100);
            //правим прочетеното число в инт
            int num = atoi(buffer);
            //добавяме му единица
            num += 1;

            char result[20];
            //правим промененото число в низ
            int res = sprintf(result , "%d", num);
            //променяме файловия дескриптор да е първия символ 
            lseek(fd, 0, SEEK_SET);
            //пишем резултата във файла
            write(fd, result, res);
    }
        else{
            //wait();
            lseek(fd, 0, SEEK_SET);
            //четем броя прочетени байта
            read(fd, buffer, 100);
            //правим прочетеното число в инт
            int num = atoi(buffer);
            //добавяме му единица
            num += 2;

            char result[20];
            //правим промененото число в низ
            int res = sprintf(result , "%d", num);
            //променяме файловия дескриптор да е първия символ 
            lseek(fd, 0, SEEK_SET);
            //пишем резултата във файла
            write(fd, result, res);
        }
    }
}